In [5]:
import pandas as pd

I was not able to load anything from an external URL so I tried to reinstall and do everything again - but I still could'nt get any connection established to external URLs. After searching on StackOverflow I saw the following "workaround/hack" that seems to work for me. I will try to get it running without that hack after the excercises.

In [ ]:
import ssl
ssl._create_default_https_context = ssl._create_unverified_context

**Load the countries.csv directly via URL import into your panda data frame!**

In [155]:
df = pd.read_csv('https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv')
display(df)

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

**Display some basic information as rows, columns and some basic statistical info.**

In [156]:
print("Index of row labels: ")
dataframe.index

Index of row labels:

RangeIndex(start=0, stop=5, step=1)

In [25]:
print("Index of column labels: ")
dataframe.columns

Index of column labels:

Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object')

In [24]:
print("Or both together: ")
dataframe.axes

Or both together:

[RangeIndex(start=0, stop=5, step=1),
 Index(['Name', 'People', 'Area', 'BIP', 'Currency'], dtype='object')]

In [27]:
print("dtypes in the DataFrame: ")
dataframe.dtypes

dtypes in the DataFrame:

Name        object
People       int64
Area         int64
BIP          int64
Currency    object
dtype: object

In [28]:
print("Number of elements: ")
dataframe.size

Number of elements:

25

In [32]:
print("Dimensionality: ")
dataframe.shape

Dimensionality:

(5, 5)

In [30]:
print("Descriptive Statistics: ")
df.describe()

Descriptive Statistics:

             People          Area         BIP
count  5.000000e+00  5.000000e+00     5.00000
mean   1.027863e+08  3.907400e+06  2716.20000
std    6.759970e+07  4.904957e+06  1457.86083
min    3.650310e+07  3.013380e+05  1529.00000
25%    6.050172e+07  3.573850e+05  1798.00000
50%    8.252165e+07  3.778350e+05  1850.00000
75%    1.260450e+08  8.515770e+06  3466.00000
max    2.083600e+08  9.984670e+06  4938.00000

**Show the last 4 rows of the data frame.**

In [38]:
df.tail(4)

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

**Show all the row of countries who have the EURO**

In [47]:
df.where(df['Currency'] == 'EUR')

      Name      People      Area     BIP Currency
0  Germany  82521653.0  357385.0  3466.0      EUR
1      NaN         NaN       NaN     NaN      NaN
2      NaN         NaN       NaN     NaN      NaN
3    Italy  60501718.0  301338.0  1850.0      EUR
4      NaN         NaN       NaN     NaN      NaN

**Because the above was not quiet that what I was excpecting - I tried this:***

In [157]:
df[df['Currency'] == 'EUR']

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

**Show only name and Currency in a new data frame**

In [49]:
df2 = df[['Name', 'Currency']]
df2

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

**Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)**

In [158]:
df[df['BIP'] > 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

**Select all countries where with inhabitants between 50 and 150 Mio**

In [159]:
df[(df['People'] >= 50000000) & (df['People'] <= 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

**Change BIP to Bip**

In [160]:
df = df.rename(columns={'BIP': 'Bip'})
df

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

**Calculate the Bip sum**

In [59]:
df['Bip'].sum()

13581

**Calculate the average people of all countries**

In [61]:
df['People'].mean()

102786293.6

**Sort by name alphabetically**

In [161]:
df.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

**Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!**

In [184]:
df3 = df.copy()

for index, row in df3.iterrows():
    if row['Area'] > 1000000:
        df3.loc[index, 'Area'] = "BIG"
    else:
        df3.loc[index, 'Area'] = "SMALL" 
df3

       Name     People   Area   Bip Currency
0   Germany   82521653  SMALL  3466      EUR
1     Japan  126045000  SMALL  4938      YEN
2    Canada   36503097    BIG  1529      CAD
3     Italy   60501718  SMALL  1850      EUR
4  Brazilia  208360000    BIG  1798     REAL